<template>
  <svg
    :width="width"
    :height="height"
    viewBox="0 0 22 22"
    fill="none"
    stroke-width="2"
    stroke="currentColor"
    stroke-linecap="round"
    stroke-linejoin="round"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      d="M8.57465 3.21666L1.51632 15C1.37079 15.252 1.29379 15.5377 1.29298 15.8288C1.29216 16.1198 1.36756 16.4059 1.51167 16.6588C1.65579 16.9116 1.86359 17.1223 2.11441 17.2699C2.36523 17.4175 2.65032 17.4968 2.94132 17.5H17.058C17.349 17.4968 17.6341 17.4175 17.8849 17.2699C18.1357 17.1223 18.3435 16.9116 18.4876 16.6588C18.6317 16.4059 18.7071 16.1198 18.7063 15.8288C18.7055 15.5377 18.6285 15.252 18.483 15L11.4247 3.21666C11.2761 2.97175 11.0669 2.76926 10.8173 2.62873C10.5677 2.4882 10.2861 2.41438 9.99965 2.41438C9.71321 2.41438 9.43159 2.4882 9.18199 2.62873C8.93238 2.76926 8.72321 2.97175 8.57465 3.21666V3.21666Z"
    />
    <path d="M10 7.5V10.8333" />
    <path d="M10 14.1667H10.0083" />
  </svg>
</template>

<script>
export default {
  name: 'AppIconWarning',
  props: {
    /**
     * Ширина
     * @type {number}
     */
    width: {
      type: Number,
      default: 24
    },

    /**
     * Высота
     * @type {number}
     */
    height: {
      type: Number,
      default: 24
    }
  }
}
</script>
